Revit 2027 API
Duct.SetSystemType Method
 Updates the associated system type for the duct.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetSystemType(
	ElementId systemTypeId
)
Public Sub SetSystemType (
	systemTypeId As ElementId
)
public:
void SetSystemType(
	ElementId^ systemTypeId
)
member SetSystemType :
        systemTypeId : ElementId -> unit
Parameters
systemTypeId ElementId
 The ElementId of the hvac system type.
Exceptions
Exception | Condition
ArgumentException |  The systemTypeId is not valid HVAC system type.
ArgumentNullException |  A non-optional argument was null
Remarks
 If the duct previously did not have a system associated to it, this will create a new system.
See Also
Reference
Duct Class
Autodesk.Revit.DB.Mechanical Namespace